{
  "plugins": {
    "Comment.nvim": [],
    "LuaSnip": [],
    "actions-preview.nvim": {
      "src": "https://github.com/aznhe21/actions-preview.nvim"
    },
    "alpha-nvim": {
      "src": "https://github.com/goolord/alpha-nvim"
    },
    "auto-indent.nvim": [],
    "auto-save.nvim": {
      "src": "https://github.com/pocco81/auto-save.nvim"
    },
    "blink.cmp": [],
    "buffer_manager.nvim": [],
    "copilot.lua": {
      "src": "https://github.com/zbirenbaum/copilot.lua"
    },
    "doing.nvim": [],
    "dressing.nvim": [],
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets"
    },
    "gitsigns.nvim": [],
    "heirline.nvim": [],
    "helpview.nvim": [],
    "hiPairs": {
      "src": "https://github.com/Yggdroot/hiPairs"
    },
    "incline.nvim": [],
    "indentmini.nvim": {
      "src": "https://github.com/nvimdev/indentmini.nvim"
    },
    "inlay-hints.nvim": {
      "src": "https://github.com/MysticalDevil/inlay-hints.nvim"
    },
    "lazy.nvim": [],
    "lazydev.nvim": [],
    "markview.nvim": {
      "src": "https://github.com/OXY2DEV/markview.nvim"
    },
    "mason-lspconfig.nvim": [],
    "mason-tool-installer.nvim": [],
    "mason.nvim": [],
    "neogen": [],
    "noice.nvim": [],
    "nui.nvim": [],
    "nvim-autopairs": [],
    "nvim-colorizer.lua": [],
    "nvim-dap": [],
    "nvim-dap-projects": {
      "src": "https://github.com/ldelossa/nvim-dap-projects"
    },
    "nvim-dap-ui": {
      "src": "https://github.com/rcarriga/nvim-dap-ui"
    },
    "nvim-dap-virtual-text": [],
    "nvim-lspconfig": [],
    "nvim-nio": {
      "src": "https://github.com/nvim-neotest/nvim-nio"
    },
    "nvim-notify": {
      "src": "https://github.com/rcarriga/nvim-notify"
    },
    "nvim-tree.lua": [],
    "nvim-treesitter": [],
    "onenord.nvim": [],
    "persisted.nvim": {
      "src": "https://github.com/olimorris/persisted.nvim"
    },
    "telescope-fzf-native.nvim": [],
    "telescope-ui-select.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-ui-select.nvim"
    },
    "telescope.nvim": [],
    "tiny-inline-diagnostic.nvim": {
      "src": "https://github.com/rachartier/tiny-inline-diagnostic.nvim"
    },
    "todo-comments.nvim": [],
    "toggleterm.nvim": {
      "src": "https://github.com/akinsho/toggleterm.nvim"
    },
    "trouble.nvim": [],
    "vim-fugitive": [],
    "which-key.nvim": []
  }
}